Merge pull request #38 from cyfko/docs/site
Docs/site
